app/controllers/clause_masters_controller.rb

  def index
    @clause_masters = ClauseMaster.all
---
SELECT "clause_masters".* FROM "clause_masters"

  def create
    @clause_master = ClauseMaster.new(clause_master_params)

    respond_to do |format|
      if @clause_master.save
---
INSERT INTO "clause_masters" ("name", "content", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "123"], ["content", "12312"], ["note", "123123123"], ["created_at", "2019-03-31 12:11:45.401925"], ["updated_at", "2019-03-31 12:11:45.401925"]]

  def update
    respond_to do |format|
      if @clause_master.update(clause_master_params)
---
UPDATE "clause_masters" SET "name" = ?, "updated_at" = ? WHERE "clause_masters"."id" = ?  [["name", "Error iusto quo recusandae cum. editted"], ["updated_at", "2019-03-31 12:12:38.341977"], ["id", 1]]

  def destroy
    @clause_master.destroy
---
DELETE FROM "clause_masters" WHERE "clause_masters"."id" = ?  [["id", 1]]

  def set_clause_master
    @clause_master = ClauseMaster.find(params[:id])
---
SELECT  "clause_masters".* FROM "clause_masters" WHERE "clause_masters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]